[
  {
    "path": "posts/2021-03-21-data-viz-makeover-3/",
    "title": "Data Viz Makeover 3",
    "description": {},
    "author": [
      {
        "name": "Vikram Shashank Dandekar",
        "url": "https://www.linkedin.com/in/vikram-dandekar-aab7aa31"
      }
    ],
    "date": "2021-03-21",
    "categories": [],
    "contents": "\r\nInitial Visualization\r\n\r\nCritiquing the Initial Visualization\r\nInteractivity\r\nWhile the visualization is intended to be spatio-temporal, but there is no temporal interactivity option provided. User can’t select a specific year or time period.\r\nThe selector for Country is not very flexible. Users can only select either one country or all. Therefore, this restricts the option to be able to look at data for multiple countries at a time. In addition, there is no way to isolate locations within each country using the visualization.\r\nManually selecting a data point on the map area does not change the graph section on the right. This does not enable the user to interact with the data to study it at a more detailed level.\r\nClarity\r\nIt is not clear what parameter is being counted and graphed per Event Type - for example, it is not clear what Sheet 1 is.\r\nThe various event type graphs are not grouped together and this makes it very difficult for users to do a comparison between event type data.\r\nA clear lead in statement is not provided. New users to the visualization, or any site where this visualization may be published, are unable to easily understand what is the data that is being visualized and what purpose the visualization serves them.\r\nAesthetics\r\nThe geospatial visualization is only plotting the data points as they exist on the map, but does not enhance/bring out key patterns. For example, there is no proportional symbol technique being used to show the user the extent of fatalities that occurred for any given events.\r\nShowing a line graph per event type at annual level does not reveal much information except a macro trend (if it exists).\r\nSuggestions for Alternate Visualization\r\nThe following table summarizes the key changes recommended to the initial visualization:\r\nAspect\r\nCritique Point Reference from above\r\nRecommendation\r\nInteractivity\r\n1\r\nA time period selection option should be provided, with the flexibility for users to customize specific time windows.\r\nInteractivity\r\n2\r\nAs different users have different requirements, country selection options should be much more flexible. Users should be able to select multiple countries in any combination at a time, instead of only one or all. Furthermore, a location dropdown option should be provided, for the occasional detailed user who needs to isolate specific locations within countries to look at the data.\r\nInteractivity\r\n3\r\nThe selections on the visual map have to reflect respectively to the data points plotted on the graphs for event counts. Otherwise, it would defeat the purpose of an interactive visualization.\r\nClarity\r\n1\r\nFor any graph shown on the visualization, proper axis labeling has to be done.\r\nClarity\r\n2\r\nConsolidate the data for each event type into one graph with multiple lines for easy comparison. In addition, the y-axis has to start from zero for fair comparisons.\r\nClarity\r\n3\r\nA lead in statement that captures the essence of the visualization must be provided, for users to gain familiarity with the data that they are interacting with.\r\nAesthetics\r\n1\r\nThe Proportional symbol techniques should be used to make the map area visually meaningful as the user changes the parameter selections.\r\nAesthetics\r\n2\r\nGraphing of event data should be done with shorter time intervals - either a monthly or quarterly level data. Since this data is available, it doesn’t make sense to hide it away from the many users who would love to analyze the data in-depth.\r\nPreparing the Proposed Visualization with Tableau\r\nImporting Data into Tableau & Data Preparation\r\nDrag and drop the Southeast Asia data file into Tableau Desktop. We observe that the required data fields are already correctly assigned in terms of data types:\r\nCountry, Latitude and Longitude are already correctly marked with Geographic data roles.\r\nFatalities are already numeric values, which is what we require.\r\nEvent Date is also marked correctly as Date & Time data type.\r\nWe are ready to create the visualization.\r\nVisualizing the Map Layer\r\nGo to the Worksheet Tab to start creating the visualization.\r\nDrag and drop Longitude into Columns and Latitude into Rows field. This should be the initial output:\r\n\r\nUnselect the “Aggregate Measures” options under the Analysis drop down:\r\n\r\nYou should now see a full South East Asia Map view with all the data points spread across:\r\n\r\nChange the Map Background to Dark:\r\n\r\nNow, drag “Event Type” into the Color option and “Fatalities” into the Size option. Adjust both Size and Opacity to ~50%:\r\n\r\nAdd the following filters in the following formats:\r\nCountry, as a multiple values List.\r\nYear, as a slider.\r\nFatalities, as a slider.\r\nLocation, as a single dropdown List.\r\nShow all the above Filters. The output should look like this:\r\n\r\nChange the Color theme to “Jewel Bright”:\r\n\r\nAdd “Location” and “Country” as tool tips to make interactive reading on-the-go much easier to the user.\r\nMow, the visualization should look like this:\r\n\r\nName the worksheet “Map Viz”. Now, we move on to creating the Event Graph, which will serve as the second part of the final Dashboard.\r\nCreating the Event Graph\r\nCreate a new Worksheet\r\nDrag “Event Date” to Columns and “Event Id Cnty” to Rows. Expand “Event Date” into Quarterly view. Adjust “Event Id Cnty” value to a Distinct Count number. Finally, drag “Event Type” into Color Marks option:\r\n\r\nFormat the axes to increase font size to 14 and Bold fonts. Label y-axis as “# of Events”. Caption the graph as “Quarterly Breakdown of Event Occurrences”. Hide the “Event Date” Field label. Finally, add in “Country” filter:\r\n\r\nName the worksheet “Event Graph”. Now, we are ready to create the Dashboard.\r\nCreating the Dashboard\r\nClick on “New Dashboard”\r\nSet the Size to “Automatic”\r\nDrag in the “Map Viz” sheet to the top half of the Dashboard and “Event Graph” sheet to the bottom half of the Dashboard:\r\n\r\nRe-adjust the tiling to enable the Event Graph to take the entire width of the dashboard.\r\nLink all the filters to all worksheets as shown in the picture below:\r\n\r\nClick on “Show Dashboard Title” and give an appropriate title to the Dashboard.\r\nAdd the Source data information at the bottom of the dashboard.\r\nFinal Visualization\r\nThe final interactive dashboard looks like this:\r\n\r\nMajor Observations revealed by the Visualization\r\nOut of the 38,244 events that took place in SEA over the decade 2010-2020, only approx. 31% of the events (11987) had fatalities. This is easily discovered by adjusting the “Fatalities” filter to start at 1 instead of 0, and then selecting the map area and checking the interactive tooltip for the count.\r\nApprox. 68% of the events occurred in the second half of the decade (2016 to 2020), indicating a rise in political tensions in the region during this time period.\r\nThe strategic developments with fatalities happened mostly in Cambodia:\r\n\r\nThe highest number of fatalities are in Myanmar while the lowest number of fatalities were in Malaysia.\r\nThere were no conflict events in the Philippines from 2010 to 2015 and they only started in 2016. This is in line with President Duterte’s election the initiation of his war on drugs.\r\nReferences\r\nTableau Help Guide - https://www.tableau.com/support/help\r\nFundamentals of Visualization - https://clauswilke.com/dataviz/\r\nhttps://acleddata.com/#/dashboard\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-21T15:58:10+08:00",
    "input_file": "data-viz-makeover-3.utf8.md"
  },
  {
    "path": "posts/2021-02-14-data-viz-makeover-2/",
    "title": "Data Viz Makeover 2",
    "description": {},
    "author": [
      {
        "name": "Vikram Shashank Dandekar",
        "url": "https://www.linkedin.com/in/vikram-dandekar-aab7aa31"
      }
    ],
    "date": "2021-02-14",
    "categories": [],
    "contents": "\r\nInitial Visualization\r\n\r\nCritiquing the Initial Visualization\r\nClarity\r\nThe titles of the charts are not well-worded. Firstly, the chart is intended to show the willingness of the countries’ residents to take the Covid-19 vaccination. This can easily be misunderstood, because the title “Which country is more pro-vaccine?” could be easily misconstrued as an indication of the political landscape in the country instead of the sentiment of the people. Secondly, this is a result of polling a sample of the countries’ populations. Therefore the title should NOT be driving the message that these are the results for the entire country. This applies to both titles.\r\nThe chart on the right is providing a subset of information that already exists in the first chart on the left. However, due to how the countries have been sorted differently in both charts, this is not apparent. Therefore in its current state, the chart on the right is essentially redundant if the stacked bar chart (left) was neatly sorted in descending order of “Strongly Agree” proportions with a clear legend.\r\nThe uncertainty of the data is not addressed in the visualization. These study results are based off a sample of each country’s population, therefore, there must be a a confidence interval shown to the reader for each point estimate per country.\r\nThe stacked bar chart on the left is not clearly showing the disparity between those who are willing to take the Covid vaccine versus those who are not, as it is just stacking the proportion of survey scores 1 through 5.\r\nAesthetics\r\nColor usage in the stacked bar chart is not appropriate. Using a variety of colors to represent the differences between “Strongly agree” all the way to “Strongly Disagree” does not help much visually.\r\nThe stacked bar chart is not sorted well. It is challenging to the eyes to pick out a trend quickly.\r\nThe tick marks on the x-axis are too light and almost invisible.\r\nSuggestions for Graphical Presentation\r\nThe following table summarizes the key changes recommended to the initial visualization:\r\nAspect\r\nCritique\r\nRecommendation\r\nClarity\r\nThe titles of the charts are not well-worded.\r\nEither a comprehensive lead-in statement should be provided, or a well-worded title should be used that captures the essence of the visualization\r\nClarity\r\nThe chart on the right is providing a subset of information that already exists in the first chart on the left.\r\nIf two charts are to be used, they should each serve a unique purpose which when combine, enhances the audience’s understanding of the visualization. Recommendation here is to use a combaination of a Likert Chart and an Error Bar chart.\r\nClarity\r\nThe uncertainty of the data is not addressed in the visualization.\r\nAn Error Bar chart can address this gap in clarity by showing the confidence interval ranges.\r\nClarity\r\nThe stacked bar chart on the left is not clearly showing the disparity between those who are willing to take the Covid vaccine versus those who are not.\r\nA Likert Scale would be a better choice to visually represent the skew between willing and unwilling participants of the Covid vaccine.\r\nAesthetics\r\nColor usage in the stacked bar chart is not appropriate.\r\nHere, using a sequential color scale would be better, regardless of whether it is single hue or multi hue.\r\nAesthetics\r\nThe stacked bar chart is not sorted well.\r\nThe chart should be sorted either in ascending or descending order of score proportions per country.\r\nAesthetics\r\nThe tick marks on the x-axis are too light and almost invisible.\r\nA better choice of opacity level should be employed when it comes to tick marks that can visually aid the readers of the chart.\r\nSketch of proposed visualization\r\n\r\nKey characteristics of proposed visualization:\r\nUsing the Likert Scale will help us to visualize clearly between positive, negative and neutral sentiments of the public.\r\nUsing an error bar chart helps us to see the range in which the proportion of “strongly agree” responses are likely to swing within the total population, using a confidence interval of 95%.\r\nHaving selection and slider fields for factors such as age, employment status and household size will enable the audience to interact with the dashboard to have a customized view of the scope of data that they would like to see.\r\nPreparing the Proposed Visualization with Tableau\r\nImporting Data into Tableau & Data Preparation\r\nAn important observation of the raw data is that there are many blank cells in the columns related to the key survey question “If a Covid-19 vaccine were made available to me this week, I would definitely get it”. This holds true for the remaining survey questions as well. Therefore, it would be necessary to exclude these data points eventually in the visualization.\r\nA quick look at the raw data shows us that there are many other countries’ data also available in the data download provided. To maintain consistency in the scope of this makeover, we will keep to the 14 countries in the original visualization. Thus, the remaining countries’ data is removed from the folder.\r\nNow, we drag & drop the first country file in the data folder(australia.csv) into Tableau. We will notice that Tableau automatically recognizes the rest of the country files in the folder.\r\nDrag and drop first country file into TableauAs each country’s data is in separate csv files, it is essential to first combine them into one large dataset. To do so, we will start by removing the australia.csv that is by default placed on the logical table:\r\nRemoving australia.csv from logical table first5.Drag and drop the “New Union” option into the logical platform & we will see a box opened for customized unions:\r\nCreating a Custom new UnionDrag and drop all 14 countries into the Union box and press “OK”:\r\nAdd all countries into UnionNow we are able to see the dataset, and it is time to make a few modifications so that we can use the data conveniently in a visualization:\r\nAs we will be focusing on the vac_1 column, lets start here. First, we will use a filter to remove all null fields. In the check box the follows after pressing “OK”, select all responses except “Null”.\r\nFiltering away null values in survey responsesNotice that only survey responses 1 & 5 have text tagged to them. We need to standardize this column to a number. To do this we use a custom split to use the hyphen “-” as separator:\r\nUsing Custom Split functionWe will notice now that Response 5 has not been split successfully while response 1 has:\r\nCustom Split only partially successfulThis is because the separator is actually different for Responses 1 & 5. One is a hyphen and the other is a subtract sign. Repeat the Custom split on the new column, using same steps as above to take care of Response 5, and we should now have a column that has the text removed.\r\nFollowing this, rename the column to “vac_1_final” and convert the data type to Number(whole). We will now use this for all further work on the visualization:\r\nSecond Custom Split solves the problemUse Aliases to assign qualitative scoreRename the “table_name” column to \"Country, and use Aliases option to type the country name, so that we get a clean look later in the visualization:\r\nCleaning the country namesWe are now done with basic data preparation. It is time to move on to creating several calculated fields that we will require for both the Likert Chart as well as the Error Bar Chart.\r\nCreation of Calcuated Fields for Likert Chart\r\nThere are several calculated fields we need to create. For all calculated fields, we go to the Sheet Page –> “Analysis” –> “Create Calculated Field”, and then type in the formulas:\r\nGetting to the Calculated Field Input boxNumber of Records - This will essentially mark each data row with a value of 1, which will help us greatly when counting:\r\nNumber of Records fieldTotal Count - This helps us to sum up the Number of Records across a table:\r\nTotal Count fieldCount_Neg_Vac_1 - This is for us to maintain a count of the scores that we consider negative. The logic is to apply a count of 1 to scores “4” and “5”, while assigning a value of 0.5 to the neutral score 3, so that it can be evenly spread across the 0 score of the Likert Scale:\r\nCount_Neg__Vac_1Total_Count_Negative_Vac_1 - This field is used to count the total number of scores we consider negative.\r\nTotal Count of Negative Vac_1Percentage - This is used to calculate the contributing percentage of each survey response per country.\r\nPercentage fieldGantt_Start_Vac_1 - This calculation determines the starting points on the Likert Scale\r\nGantt Start fieldGantt_Percent_Vac_1 - This is a formula to calculate the start/end points on the scale to show the next response results.\r\nGantt Percent fieldWe are now ready to create the Likert Chart.\r\nCreating the Likert Chart visualization\r\nDrag the “Gantt_Percent_Vac_1” field into Columns and the “Country” field into Rows, followed by adding “vac_1_final” to the detail level as shown here:\r\n\r\nChange the type of chart to “Gantt Bar”:\r\n\r\nChange the method of computation of the “Gantt_Percent_Vac_1” field to use “vac_1_final” instead of the original “Table(down)” setting.\r\n\r\nDrag in the “Percentage” field into “Size” option and the “vac_1_final” field into “Color” option:\r\n\r\nSort Country in Descending order of Gantt_Percent_Vac_1:\r\n\r\nAdjust the color of the Response bars from dark blue for “Strongly Agree” to dark red for “Strongly Disagree”, with “Neutral” shown in grey.\r\n\r\nAdd in filters:\r\ngender (single value list)\r\nage (slider)\r\nhousehold size (single value slider)\r\nhousehold children (slider)\r\nemployment status (single value drop down)\r\n\r\nAdjust the window fit to “Entire View”, increase the font size of the Axis Labels and Values to 15 and Bold. Finally, remove the title:\r\n\r\nWe have now completed the Likert Chart. Now, we move to the second part of the visualization that we are creating, which is the Error Bar Chart.\r\nCreation of Calculated Fields for Error Bar Chart\r\nTo show the confidence intervals in an error bar chart, there are several calculated fields we need to create. For all calculated fields, we go to the Sheet Page –> “Analysis” –> “Create Calculated Field”, and then type in the formulas:\r\nZ_95% - We will be creating 95% Confidence Intervals in this visualization, therefore we need to store the Z value for 95% C.I:\r\n\r\nStrong_Agree - We need to create a field to identify which rows in the data set we are taking for the error bar, in this case these are all the responses for “Strongly Agree” across all countries, therefore we need to mark all vac_1_final entries of value “1”:\r\n\r\nProp_Strong_Agree - Next, we create a proportion value for earlier calculated Strong_Agree value:\r\n\r\nProp_Strong_Agree_SE - This is to calculate the standard error:\r\n\r\nMargin_of_error_95% - This is to calculate the margin of error for a 95% C.I.\r\n\r\nLowerLimit_95% and UpperLimit_95% - Finally, we calculate the Upper and Lower Limits of the C.I\r\n\r\nWe are now ready to create the Error Bar Chart.\r\nCreating the Error Bar Chart visualization\r\nDrag “Prop_Strong_Agree” field to Columns and “Country” to Rows:\r\n\r\nDrag “Measure Values” to Columns and remove all except UpperLimit_95% and LowerLimit_95%:\r\n\r\nConvert to “Dual Axis” View & Synchronize the Axes:\r\n\r\n\r\nChange “Measure Values” mark to Line, and use the “Path” option. We can now see the error bars:\r\n\r\nSwitch the “Measure Names” under “AGG_Prop_Strong_Agree” mark to Color. Then, adjust the thickness of the line and the size of the circle for both “AGG_Prop_Strong_Agree” and “Measure Values”marks:\r\n\r\nSimilar to the Likert Chart, adjust the window fit to “Entire View”, increase the font size of the Axis Labels and Values to 15 and Bold. Here, we also hide the second axis at the top of the chart. Finally, remove the title and Sort the error bars by descending values by country:\r\n\r\nAdd in filters:\r\ngender (single value list)\r\nage (slider)\r\nhousehold size (single value slider)\r\nhousehold children (slider)\r\nemployment status (single value drop down)\r\n\r\nCreating the Dashboard\r\nIt is time to create an interactive Dashboard that combines both visualizations that we have created.\r\nStart a new Dashboard tab, set the Size to “Automatic” and drag in both charts into the workspace:\r\n\r\nClick on “Show Dashboard Title” at the bottom left, and add the title “Willingness of Public to take COVID-19 Vaccination”\r\n\r\nConvert the Likert legend to “Floating” and drag it to a blank area in the Likert Chart so that it is visually easier for the reader to compare.\r\n\r\n\r\nSynchronize each filter to both charts by applying to all Worksheets:\r\n\r\nMake a final few touch ups:\r\nAdjust “vac_1_final” data column name to “Response”\r\nGive x-axes of both chart relevant titles\r\nClean title names for all filters by adjust the Data source column names - household size, age, gender, employment status, household children\r\nFinal Visualization\r\nThe final interactive dashboard looks like this:\r\nCompleted Interactive VisualizationKey Observations revealed by the Visualization\r\nThe willingness of the Singapore population to take the COVID vaccine is very low as compared to the European countries. This is interesting because even though Singapore is one of the countries that has managed the COVID situation very well, and has been enjoying a stable “Phase 3” environment throughout the period of this survey, very few Singaporean residents seem to be open to the COVID-19 vaccine, even if they were given an opportunity to take it. This points to a lack of trust in the effectiveness or even the safety factor of taking the vaccination. From another perspective, this is also not surprising, since life in Singapore is not far from the pre-COVID normal, with only the basic safety & distancing measures that need to be observed. Hence, Singaporeans probably do not feel the urgency to get themselves protected with the vaccination even if they had the option.\r\nBetween the Male & Female Gender, every country’s Females responded with a lower proportion to “Strongly Agree” versus Males. This could have a couple of reasons behind. Firstly, it is likely that there are a larger number of females who are homemakers compared to Males, and feel less strongly about the need for a vaccination if more of their time is spent at home. Secondly, we could be looking at a general trend that Males tend to be less risk-averse to taking this new vaccination.’\r\nIndividuals between the ages of 18 to 50 have a much lower willingness to take the vaccine versus those between 51 and 99. This is most likely due to the general sentiment that there is a much lower risk of fatal consequences for a younger person infected with COVID. While we do see special circumstances where COVID paired with other complications leads to a quick death for a considerable number of people regardless of the age group, this has happened within a much smaller proportion of the global population.\r\nReferences\r\nTableau Help Guide - https://www.tableau.com/support/help\r\nFundamentals of Visualization - https://clauswilke.com/dataviz/\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-19T22:10:24+08:00",
    "input_file": "data-viz-makeover-2.utf8.md"
  },
  {
    "path": "posts/2021-01-28-data-viz-makeover-1/",
    "title": "Data Viz Makeover 1",
    "description": {},
    "author": [
      {
        "name": "Vikram Shashank Dandekar",
        "url": "https://www.linkedin.com/in/vikram-dandekar-aab7aa31"
      }
    ],
    "date": "2021-01-28",
    "categories": [],
    "contents": "\r\nInitial Visualization\r\n\r\nCritiquing the Initial Visualization\r\nClarity\r\nThe lead-in statement and visualization are not synchronized. The graph does not bring out the key changes of the labor force highlighted in the lead-in. There is no LFPR data in the graph, only labor force percentages by age buckets. Furthermore, the age ranges described don’t match the age buckets in the graph.\r\nData is provided as a table below the graph, without any indication of units. This is difficult to read & relate to as a total visualization.\r\nLack of proper axes and labels - The x-axis is not labeled and there is no y-Axis.\r\nThe median age lines are using the discrete x-axis scale (age range) to attempt to represent two continuous data points (median age), which is incorrect & unclear. Furthermore, having these lines intersect with the line graphs does not provide any helpful visual insight.\r\nAesthetics\r\nTick marks are shown even though the x axis is categorical in scale.\r\nChart is pixelated - Image quality is not addressed properly.\r\nIt is hard to read the line graph with points representing age buckets.\r\nSuggestions for Graphical Presentation\r\nThe following table summarizes the key changes recommended to the initial visualization:\r\nAspect\r\nCritique\r\nRecommendation\r\nClarity\r\nThe lead-in statement and visualization are not synchronized.\r\nGiving priority to the lead-in statement, the data used should consist of both labor force percentages as well as LFPR percentages for the specific age groups identified in the lead-in statement.\r\nClarity\r\nData is provided as a table below the graph, without any indication of units.\r\nThe data should firstly be visually represented as part of the chart and not as a separate table below the chart. Also, there should be clear units of measure stated.\r\nClarity\r\nLack of proper axes and labels\r\nThe chart should have a clear x-axis and y-axis, with appropriate labels and units of measure. There should also be a dual axis to represent the LPFR separately from the labor force percentages.\r\nClarity\r\nIncorrect usage of the median age lines.\r\nThere is no need to try force-fitting median age lines on the chart, especially when the axes do not have age as a unit of measure. Providing these two numbers can be done via a simple lead-in statement.\r\nAesthetics\r\nTick marks are shown even though the x axis is categorical in scale.\r\nTick marks are not necessary as the x axis is categorical in scale.\r\nAesthetics\r\nChart is pixelated.\r\nImage quality must be taken into consideration when publishing a visualization.\r\nAesthetics\r\nIt is hard to read the line graph with points representing age buckets.\r\nThere should be light grid lines on the chart to make it easy for the reader to read the line graphs in relation to the axes.\r\nSketch of proposed visualization\r\n\r\nKey characteristics of proposed visualization:\r\nFirstly, the axes need to be properly provided. A dual axis setup is proposed. The first y-axis will show the labor force % while the 2nd y-axis to chart the LFPR %.\r\nTo clearly relate to the lead-in statement, the data in the visualization has to be grouped clearly into the appropriate age range buckets. This will enable the reader to immediately read and relate to the changes described in the lead-in statement for the time window of 2009 to 2019.\r\nBars to represent the changes of the labor force percentages of each age group across the years.\r\nTo complement the bars, line graph should be used to show how the LFPR is changing across the years per age group. This will enable visual clarity and bring out the relationship between the two metrics in one glance.\r\nPreparing the Proposed Visualization with Tableau\r\nData Preparation\r\nThe first observation of the data source is that the table directly downloaded from MOM site is heavily formatted with several merged rows and columns. As such, it is not a good base file to use when importing into Tableau as there will be many null cells cluttered around if we simply drag and drop. Therefore, a basic cleanup of the original source file is far simpler and recommended versus navigating the modifications in the Data Source module of Tableau.\r\nSecondly, the data Table 5 from the MOM site is not sufficient for us to prepare a visualization that can bring out the trends stated in the lead-in statement. We will require Table 7 as well from the same site, and this was downloaded.\r\nFinally, both Table 5 and Table 7 were cleaned and copied into a new excel file named “Raw Input” as separate tabs. Main formatting work done was to unmerge the formatted rows and columns to create clean data tables as such:\r\nTable 7 cleanedTable 5 cleanedImporting the Data into Tableau\r\nAfter opening Tableau desktop, the Raw Input file was imported in. Following this, the Labor Force tab is first dragged & dropped into the logical tables panel:\r\n We immediately notice that the column headers are not captured correctly. This is because the data in the raw input file is not aligned to the first row/column. This is easily fixed by checking the “Use Data Interpreter” box on the left to obtain the following:\r\nLabor Force table - fixed row/column alignment!Next, we drag in the LFPR table. Upon doing this, Tableau will prompt us to link up the LFPR logical table with the Labor Force table that is already present in order to form the relationship. Here, we select the Age (Years) data column as the common link, and doing so will reveal the LFPR table (with a relationship established to the Labor Force table:\r\nEstablishing relationship between two logical tables - LFPR & Labor ForceNow that we have brought in the data into Tableau, it is time to structure it in a suitable manner to help us create the right visualization easily.\r\nStructuring the Data for analysis\r\nFirst, we pivot all the individual year columns by selecting them simultaneously and using the Pivot option from the small drop down on the headers:\r\n The result is a pivoted table where each row now has an age bucket, the Year and the Labor Force population pertaining to that Age bucket and year. We then re-label the newly formed columns as well as adjust the data type of the Year column to “Date”:\r\n Recall that we want to categorize the age bucket into three distinct groups that are consistent with the information in the lead-in statement. To do this, we use the drop down list on the Age(Years) column and choose the “Create Group” option:\r\n Once inside the Group editor, we highlight multiple age buckets that we want to group together, and then press “Group” button, followed by renaming the Group to a suitable name, as shown here:\r\nCreating Groups and Renaming appropriatelyAfter this, we click “Apply” and press “OK”. We now see that a column of Groups is successfully created:\r\n These groupings will help us to create the visualization very easily later on. Moving on, the same steps of Pivoting and Grouping of Age buckets and performed on the LFPR table and this gives us the result:\r\nGrouping successful for LFPR TableThe next step that is required now is to link up the “Year” and “Year (Lfpr)” columns via the matching in the Logical Table:\r\n Finally, we will need to filter away the “All” Grouping of the age buckets so that it doesn’t come in the way of creating the Visualization later. To do this, we simply click on the “Add” button under Filters in the top right and configure “All” grouping to be excluded for both tables:\r\nFilter away the “All” bucket from the tablesWe are now ready to create the visualization.\r\nCreating the Base Visualization\r\nFirst, we drag in the “Age Years (Group)” as Column, “Year” as Column and “Population (’000)” as Row to get a basic skeleton:\r\n Now, we add in the “LFPR(%)” Data as a second Y Axis into the visualization using the “Dual Axis” option:\r\n The output will look like this:\r\nFirst Dual Axis output showing both LFPR and Labor Force DataNotice that the axis are not in the intended units that we would like. Therefore, we first amend the Population Axis using a Table calculation to show the percentage of total labor force for each data point. Note that we need to use “Specific Dimensions” setting and un-check the “Year of Year” option in order to correctly calculate the % of labor force within the Age Groupings:\r\n Next, it is time to adjust the LFPR. Notice that by default, the axis values are under the “SUM” calculation. This needs to be changed to “AVERAGE” to correctly show the LFPR percentages within each age group by Year:\r\n We now see that the basic data is in place and showing correctly:\r\n It is now time to apply some Visualization fundamentals to enhance the aesthetics of the chart and make it easy to read for the audience.\r\nBeautifying the Visualization\r\nFirstly, the following are performed:\r\nX-axis is formatted to show the Year numbers horizontally.\r\nBoth X & Y Axes are formatted to increase font size & Bold.\r\nThe Age bucket labels are also formatted to increase font size & Bold.\r\nThe “Age (Years)(Group)” Label is kept hidden\r\nThe Labor Force population data is switched to a Bar chart visualization, while the LFPR data is selected as a Line chart.\r\n“Age (Years)(Group)” and “Age (Years)(LFPR)(Group)” are dragged and dropped onto the Color marks to enable color customization of all Bar groups & Lines individually.\r\nThus far, we have the following visualization:  Next, the following fine modifications are made in order to to make the visualization more appealing:\r\nThe LPFR Lines are adjusted to have line markers, and their size is adjusted lower to keep it easier on the viewer’s eyes\r\nThe LFPR line labels are turned on, but only for the ends. This will reveal the LFPR changes that is directly linked with what the lead-in statement mentions.\r\nThe Opacity of the Bars are adjusted down to 80% to soften the look. Light color borders are added.\r\nThe size of the Bars are adjusted down slightly to mitigate the overpowering look of many thick bars.\r\nAfter performing these changes, the visualization will look as such:\r\nSecond Level formatting of lines/bars completedTo finish up the visualization, the following final touches are made:\r\nThe color scheme of the bars is adjusted as close as possible to the qualitative color scale of ggplot2 hue.\r\nThe chart is given a Caption, which includes the title, a short explanation of the visualization and the data source details.\r\nFinal Visualization\r\nHere is the Final Visualization at the end of the Makeover process:\r\nFinal VisualizationKey Observations revealed by the Visualization\r\nFor the labor force aged 24-52, the Labor Force Participation rate has increased through 2009 to 2019, but their population is decreasing as a portion of the total labor force. This is most likely due to the slower influx of residents with ages 15-24 into the 24-52 group versus the outgoing population into the “55 and above” bracket.\r\nThe percentage of the labor force aged 55 and above has been steadily increasing from approximately 40% in 2009 to 50% in 2019. This is a clear indicator of an aging population.\r\nThe percentage of the labor force aged 15 to 24 has generally been slowly decreasing from ~9% in 2009 to below 8% in 2019. This points to a slowdown in the birth rate in Singapore. This would also explain the flat LFPR trend of this age group.\r\nReferences\r\nTableau Help Guide - https://www.tableau.com/support/help\r\nFundamentals of Visualization - https://clauswilke.com/dataviz/\r\nYouTube guide for Tables - https://www.youtube.com/watch?v=a0rM8wAp4U0\r\nTable 5: RESIDENT LABOUR FORCE PARTICIPATION RATE BY AGE AND SEX, 2009 - 2019 (JUNE) - https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx\r\nTable 7: RESIDENT LABOUR FORCE PARTICIPATION RATE BY AGE AND SEX, 2009 - 2019 (JUNE) - https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-28T21:05:02+08:00",
    "input_file": "data-viz-makeover-1.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to IDEA",
    "description": "Welcome to our new blog, IDEA. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Vikram Dandekar",
        "url": "https://www.linkedin.com/in/vikram-dandekar-aab7aa31"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-04T21:01:14+08:00",
    "input_file": "welcome.utf8.md"
  },
  {
    "path": "posts/2021-01-04-my-first-post/",
    "title": "My first post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Vikram Dandekar",
        "url": "https://www.linkedin.com/in/vikram-dandekar-aab7aa31"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-04-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-05T20:27:16+08:00",
    "input_file": "my-first-post.utf8.md"
  }
]
